schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
#if defined(HAS_MCP2515)
  #define SOCKETCAND_NUM_CHANNELS 2
#else
  #define SOCKETCAND_NUM_CHANNELS 1
#endif

enum SocketcandState {
    SC_DISCONNECTED,
    SC_WAITING_OPEN,
    SC_WAITING_RAWMODE,
    SC_RAWMODE,
};

struct SocketcandSlot {
    WiFiClient      client;
    SocketcandState state   = SC_DISCONNECTED;
    char            buf[64];
    uint8_t         len     = 0;
    int8_t          channel = -1;   // set when `< open canN >` is parsed
    uint32_t        opened_ms = 0;  // millis() when the TCP connection arrived
};

static WiFiServer     socketcand_server(SOCKETCAND_PORT);
static SocketcandSlot socketcand_slots[SOCKETCAND_NUM_CHANNELS];

static void socketcandCloseSlot(SocketcandSlot& slot) {
    slot.client.stop();
    slot.state   = SC_DISCONNECTED;
    slot.len     = 0;
    slot.channel = -1;
}

// True if the client's socket can take a write right now. WiFiClient::write
// has no non-blocking form — on a stalled client (phone out of range, no FIN)
// it select()s up to 1 s per call, which would stall CAN RX and every other
// service behind one dead peer. lwIP reports a socket writable only when at
// least TCP_SNDLOWAT (~half the send buffer) is free, so a whole frame line
// always fits once this returns true.
static bool socketcandWritable(WiFiClient& client) {
    int fd = client.fd();
    if (fd < 0) return false;
    fd_set wset;
    FD_ZERO(&wset);
    FD_SET(fd, &wset);
    struct timeval tv = {0, 0};
    return select(fd + 1, nullptr, &wset, nullptr, &tv) > 0;
}

void socketcandSendFrame(const twai_message_t& msg, int8_t channel) {
    uint32_t now_ms = millis();
    uint32_t secs   = now_ms / 1000;
    uint32_t usecs  = (now_ms % 1000) * 1000;
    // EFF flag (bit 31) marks the ID as 29-bit extended — python-can expects this.
    uint32_t id_wire = msg.identifier | (msg.extd ? 0x80000000UL : 0);
    char line[80];
    int n = snprintf(line, sizeof(line), "< frame %lX %lu.%06lu ",
                     (unsigned long)id_wire,
                     (unsigned long)secs, (unsigned long)usecs);
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof(line) - 4; i++)
        n += snprintf(line + n, sizeof(line) - n, "%02X", msg.data[i]);
    n += snprintf(line + n, sizeof(line) - n, " >");
    for (auto& slot : socketcand_slots) {
        if (slot.state == SC_RAWMODE && slot.channel == channel) {
            if (socketcandWritable(slot.client))
                slot.client.write((const uint8_t*)line, n);
            else
                g_socketcand_tx_dropped++;
        }
    }
}

// Parse "< send <idhex> <dlc> <b0> <b1> ... >" (rawmode TX) and inject the frame
// onto this slot's CAN controller. We accept both extended-ID encodings seen in
// the wild: standard socketcand/python-can distinguishes 29-bit frames purely by
// id-field width (3 hex chars => 11-bit, otherwise extended, no flag bit), while
// some clients also OR the EFF flag into bit 31 — either marks the frame
// extended here. Byte tokens may be 1 or 2 hex digits; the dlc (0..8) reads the
// same in decimal or hex. Anything unparseable is dropped, like a real daemon.
static void socketcandHandleSend(SocketcandSlot& slot, const char* cmd) {
#if !CAN_TX_ENABLED
    (void)slot; (void)cmd;              // listen-only build: injection disabled
#else
    const char* p = cmd + 7;            // past "< send "
    char* end = nullptr;
    unsigned long id_val = strtoul(p, &end, 16);
    if (end == p) return;
    int id_len = (int)(end - p);
    p = end;
    long dlc = strtol(p, &end, 16);
    if (end == p || dlc < 0 || dlc > 8) return;
    p = end;
    uint8_t data[8] = {0};
    int got = 0;
    while (got < dlc) {
        long b = strtol(p, &end, 16);
        if (end == p) break;            // fewer tokens than dlc — leave zero-padded
        data[got++] = (uint8_t)(b & 0xFF);
        p = end;
    }
    bool extended = (id_val & 0x80000000UL) != 0 || id_len > 3;
    uint32_t id = extended ? (id_val & 0x1FFFFFFFUL) : (id_val & 0x7FFUL);

    if (slot.channel == 0) {
        canTransmit0(id, extended, (uint8_t)dlc, data);
    }
#if defined(HAS_MCP2515)
    else if (slot.channel == 1 && g_mcp_initialized) {
        CANMessage tx;
        tx.id  = id;
        tx.ext = extended;
        tx.rtr = false;
        tx.len = (uint8_t)dlc;
        memcpy(tx.data, data, (size_t)dlc);
        g_mcp.tryToSend(tx);
    }
#endif
#endif  // CAN_TX_ENABLED
}

static void socketcandHandleCommand(SocketcandSlot& slot, const char* cmd) {
    if (slot.state == SC_WAITING_OPEN && strncmp(cmd, "< open ", 7) == 0) {
        // Parse "< open canN >": after "< open " expect "canN" then space-or-'>'.
        const char* arg = cmd + 7;
        if (strncmp(arg, "can", 3) == 0 && arg[3] >= '0' && arg[3] <= '9'
                && (arg[4] == ' ' || arg[4] == '>')) {
            int ch = arg[3] - '0';
            if (ch < SOCKETCAND_NUM_CHANNELS) {
                slot.channel = (int8_t)ch;
                slot.state   = SC_WAITING_RAWMODE;
                slot.client.print("< ok >");
                return;
            }
        }
        slot.client.print("< error >");
    } else if (slot.state == SC_WAITING_RAWMODE && strcmp(cmd, "< rawmode >") == 0) {
        slot.client.print("< ok >");
        slot.state = SC_RAWMODE;
    } else if (slot.state == SC_RAWMODE && strncmp(cmd, "< send ", 7) == 0) {
        socketcandHandleSend(slot, cmd);
    }
    // bcmmode/isotpmode/echo/statistics are intentionally unsupported.
}

void socketcandPoll() {
    WiFiClient new_client = socketcand_server.available();
    if (new_client) {
        int free_idx = -1;
        for (int i = 0; i < SOCKETCAND_NUM_CHANNELS; i++) {
            if (socketcand_slots[i].state == SC_DISCONNECTED) { free_idx = i; break; }
        }
        if (free_idx >= 0) {
            SocketcandSlot& slot = socketcand_slots[free_idx];
            slot.client  = new_client;
            slot.client.setNoDelay(true);
            slot.client.print("< hi >");
            slot.state   = SC_WAITING_OPEN;
            slot.len     = 0;
            slot.channel = -1;
            slot.opened_ms = millis();
        } else {
            new_client.stop();   // pool full — keep the existing clients
        }
    }
    for (auto& slot : socketcand_slots) {
        if (slot.state != SC_DISCONNECTED && !slot.client.connected()) {
            socketcandCloseSlot(slot);
        }
        if ((slot.state == SC_WAITING_OPEN || slot.state == SC_WAITING_RAWMODE)
                && millis() - slot.opened_ms > SOCKETCAND_HANDSHAKE_MS) {
            socketcandCloseSlot(slot);
        }
        while (slot.client && slot.client.available()) {
            char c = slot.client.read();
            if (c == '<') {
                slot.len = 0;
                slot.buf[slot.len++] = c;
            } else if (slot.len > 0 && slot.len < sizeof(slot.buf) - 1) {
                slot.buf[slot.len++] = c;
                if (c == '>') {
                    slot.buf[slot.len] = '\0';
                    socketcandHandleCommand(slot, slot.buf);
                    slot.len = 0;
                }
            }
        }
    }
}

// ── BLE (Nordic UART Service) ─────────────────────────────────────────────────
// Pushes a compact (minimal) JSON snapshot to a single BLE central — every
// BLE_PUSH_INTERVAL_MS while CAN frames are arriving, dropping to a slow
// BLE_HEARTBEAT_MS cadence on a quiet bus. The heartbeat exists because some
// fields change with time rather than with frames (uptime, last_frame_age_s,
// the tractor on/off flag): the client must still see those move after the
// bus goes silent. Framing on the wire is:
//
//     [u16 big-endian length] [length bytes of JSON]
//
// sent across N notifications of up to BLE_CHUNK_BYTES each. The Android
// client reassembles by counting bytes against the length prefix. Connection
// is unpaired — anyone in range with the NUS UUID can subscribe.
//
// MTU: we request 517 server-side; the actual MTU is whatever the client
// negotiates. BLE_CHUNK_BYTES is conservative so a default-MTU client (23)
// would still receive valid (if smaller) packets — but the Android app calls
// requestMtu(517) on connect.
//
// RX characteristic is exposed for future command/control (e.g. reset session
// counters); currently writes are accepted and ignored.

#define NUS_SVC_UUID  "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_TX_UUID   "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_RX_UUID   "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"

#define BLE_CHUNK_BYTES        180
#define BLE_PUSH_INTERVAL_MS   200    // push cadence while CAN frames are arriving
#define BLE_HEARTBEAT_MS       2000   // idle cadence — keeps time-derived fields fresh

#define BLE_INTER_CHUNK_DELAY  5      // min ms between chunk notifies (paced by bleTick)

static BLEServer*         g_ble_server = nullptr;
static BLECharacteristic* g_ble_tx     = nullptr;
static volatile bool      g_ble_connected  = false;
static volatile bool      g_ble_force_push = false;
static uint32_t           g_ble_last_push_ms = 0;
static uint32_t           g_ble_frames_at_push = 0;   // g_frames_rx at last push

class BleServerCb : public BLEServerCallbacks {
    // These callbacks run on the Bluedroid task, not loop() — they may only
    // touch the volatile flags, never heap-backed state the loop task owns.
    void onConnect(BLEServer*) override {
        g_ble_connected  = true;
        g_ble_force_push = true;   // full snapshot immediately on (re)connect
    }
    void onDisconnect(BLEServer* s) override {
        g_ble_connected = false;
        s->getAdvertising()->start();   // resume advertising for the next client
    }
};

